[
  {
    "id": 1,
    "image": "page1.png",
    "title": "Що таке HTML та як це працює",
    "paragraphs": [
      "<p>HTML (HyperText Markup Language — мова розмітки гіпертексту) — стандартизована мова розмітки документів для перегляду вебсторінок у браузері. Браузери чудово розуміють html і можуть інтерпретувати у зрозумілому для людини вигляді.</p>",
      "<p>Уявіть, що ви клікнули в гуглі на посилання, щоб перейти на якийсь сайт. У цей момент браузер звертається до сервера сайту і отримує файл у форматі HTML. Але поки це лише набір елементів, які позначають спеціальними позначками – тегами. Щоб перетворити їх на заголовки, кнопки, посилання, зображення, браузер інтерпретує теги відповідно до правил мови HTML.</p>",
      "<p>Таким чином, документ HTML – це своєрідний план з інформацією, з яких будівельних блоків і в якому порядку збирати веб-сторінку. Блоками виступають набори тегів. Майже всі теги парні. Відкриваючий показує, де елемент починається, а закриваючий – де закінчується. Наприклад, щоб створити абзац, потрібно помістити текст між вихідним тегом &lt;p&gt; та закриваючим &lt;/p&gt; .</p>"
    ]
  },
  {
    "id": 2,
    "image": "page2.webp",
    "title": "Для чого використовують HTML",
    "paragraphs": [
      "<p>Читаючи ці рядки, ви використовуєте HTML. Сьогодні сайти є практично у всіх, починаючи від корпорацій та закінчуючи фахівцями з манікюру. І всі вони написані на HTML. Веб-версії мають програми, сервіси, ігри, Viber та Telegram.</p>",
      "<p>На HTML написано багато програм, які ми вважали десктопними або мобільними. І якщо клацнути правою клавішею і вибрати “Переглянути код”, то всюдисущий тег &lt;div&gt; виявиться і в Google Drive, і в Facebook, і на сайті ПриватБанку.</p>"
    ]
  },
  {
    "id": 3,
    "image": "page3.webp",
    "title": "Історія появи",
    "paragraphs": [
      "<p>1989 року програміст міжнародного центру високих енергій у Женеві Тім Бернерс-Лі запропонував проект Всесвітньої павутини, або World Wide Web. Ідея полягала в тому, щоб створити систему взаємопов’язаних гіпертекстових документів, розміщених на комп’ютерах по всьому світу. Для реалізації Тім та його помічники розробили технології, без яких просто неможливо уявити собі сучасний інтернет.</p>",
      "<ul><li><strong>HTTP</strong> – протокол, який дозволяє передавати документи від клієнта до сервера;</li><li><strong>URL</strong> – унікальна адреса, яка визначає розташування ресурсу в Інтернеті;</li><li><strong>HTML</strong> – це мова гіпертекстової розмітки для створення веб-документів.</li></ul>",
      "<p>Не применшуючи заслуг Бернерса-Лі, скажімо, що HTML не з’явився на порожньому місці. За його основу «батько інтернету» взяв уже добре відому на той час мову розмітки SGML. І навіть візитна картка HTML – теги з кутовими дужками – також звідти.</p>",
      "<p>Першим офіційним описом HTML став документ Теги HTML, який Бернерс-Лі опублікував у 1991 році. До нього увійшли 18 структурних та семантичних елементів – дескрипторів, або тегів. Невелика кількість елементів вирішила проблему складності SGML, але водночас дозволяла створювати прості та красиво оформлені документи. Крім того, HTML отримав підтримку гіпертексту.</p>",
      "<p>Зі зростанням популярності Мережі стало зрозуміло, що мова гіпертекстової розмітки потребує розвитку. Але нововведення повинні підкорятися єдиним стандартам, щоб кожен сайт можна було легко відкрити на будь-якому браузері. Створенням таких стандартів мав займатися Консорціум Всесвітньої Павутини, або W3C, який у 1994 році заснував Тім Бернерс-Лі. Ця міжнародна спільнота продовжує працювати над розробкою веб-стандартів. На сьогодні актуальною є їхня версія HTML з порядковим номером 5.3.</p>"
    ]
  },
  {
    "id": 4,
    "image": "page4.jpeg",
    "title": "Що можна і не можна зробити на HTML?",
    "paragraphs": [
      "<p>Як ми вже говорили, HTML вказує браузеру, з яких елементів і в якому порядку збирати веб-сторінку, а також де брати стилі елементів і скрипти. Він також дозволяє організовувати інформацію у різний спосіб. Наприклад, створювати таблиці, списки, параграфи, форматувати текст, додавати зображення, заголовки, посилання та кнопки.</p>",
      "<p>Але його функціоналу мало, щоб оформити зовнішній вигляд елементів та змусити їх реагувати на дії користувачів. З цією метою використовують стилі CSS та мову JavaScript.</p>",
      "<p>СSS, або каскадні таблиці стилів, – це мова, якою описують зовнішню, візуальну сторону HTML-документів. Спільне використання HTML і CSS спрощує розробку, оскільки властивості можна прописати один раз для безлічі однакових елементів. Без CSS, навпаки, частина можливостей втрачається. Не можна додавати дизайнерські шрифти, встановлювати фон веб-сторінки, вказувати стилі для різних станів об’єкта.</p>",
      "<p>Хоча HTML і є мовою розмітки, в ньому все ж таки присутні деякі елементи оформлення. Так тег &lt;strong&gt; може зробити текст жирним, а тег &lt;i&gt; – курсивним. Але на практиці HTML надає цим тегам насамперед смислове (семантичне) значення. Тому використання елементів &lt;strong&gt;та &lt;i&gt; заради візуального ефекту вважається поганим тоном.</p>",
      "<p>JavaScript – це мова програмування, яку створили спеціально, щоб зробити сторінки живими. Програми, які написали на JavaScript, легко вбудовуються в HTML і автоматично виконуються під час завантаження сторінки. Без JavaScript HTML також втрачає частину своїх функцій: не можна додавати анімації, створювати інтерактивні елементи, додавати пошук по сторінці.</p>"
    ]
  },
  {
    "id": 5,
    "image": "page5.webp",
    "title": "Основні HTML-теги",
    "paragraphs": [
      "<ul><li>&lt;html&gt; – Тег HTML вказує початок і кінець HTML документа.</li><li>&lt;head&gt; – Тег HEAD (заголовок HTML-документа) містить інформацію, що сточується документа в цілому.</li><li>&lt;body&gt; – Тег BODY охоплює ту частину HTML-документа (текст, зображення й елементи формування), що буде видна користувачеві</li><li>&lt;title&gt; – Тег TITLE установлює заголовок HTML-документа, виведений у рядку заголовка вікна броузера.</li><li>&lt;h1&gt; – Тег H1 визначає заголовок першого рівня (самі великі букви в заголовку). Усього є шість рівнів заголовків.</li><li>&lt;p&gt; – Тег P установлює початок і кінець абзацу.</li><li>&lt;ul&gt; – Тег UL («unordered list» – неупорядкований список) установлює режим відображення тексту у вигляді маркірованого списку.</li><li>&lt;li&gt; – Тег LI установлює режим відображення тексту у вигляді пункту списку. Такий список може бути неупорядкованим, упорядкованим або маркірованим.</li><li>&lt;div&gt; – Тег DIV використається для структурування й форматування тексту.</li><li>&lt;img&gt; – Тег IMG установлює режим відображення графічного файлу.</li></ul>"
    ]
  }
]
